// Блок подключения библиотек и пространства имён
#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;
//---------------------------------------------------------------------------------------------------
// Основное тело программы
int main() {
//---------------------------------------------------------------------------------------------------
// Блок объявления переменных и масивов
	int CountR1 = 0, CountR3 = 0;
	double Y5, V1 = -30.7, W1 = -0.18, G0 = 1.0, A1 = NULL, A3 = NULL, MAX1 = NULL, X[] { 0.01,0.02,-0.5,2.31,0.0,1.0,0.0,-1.25,-1.0,-0.77,0.0 };
	double R1[(sizeof(X) / sizeof(double))]{ NULL }, R3[(sizeof(X) / sizeof(double))]{ NULL };
//---------------------------------------------------------------------------------------------------
// Блок расчёта и вывода Y5 и зависящих от неё переменных
	cout << setfill(' ') << setw(21) << "X|" << setw(21) << "Y5|" << endl;
	for (int i = 0; i < (sizeof(X) / sizeof(double)); i++) {
		if (exp(sin(X[i])) > 1.5) {
			Y5 = (pow(X[i], 2.0) * cos(X[i]) - 0.7 * pow(10.0, 3.0) * exp(sin(X[i]))) / (1.6 + 0.9 * pow(10.0, 0.9) * pow(X[i], 2.0));
		} else {
			Y5 = 5.67 * pow(10, (-3)) * pow(fabs(X[i]), (1.0 / 3.0)) + 2.14 * exp(sin(X[i]));
		}
		cout << setw(20) << X[i] << "|" << setw(20) << Y5 << "|" << endl;
		G0 *= Y5;
		if (Y5 < V1) {
			A1 += Y5;
		} else {
			A3 += Y5;
		}
		if (fabs(Y5) > MAX1) {
			MAX1 = fabs(Y5);
		}
		if (Y5 < W1) {
			R1[CountR1] = Y5;
			CountR1++;
		}
		if (Y5 < 0) {
			R3[CountR3] = Y5;
			CountR3++;
		}
	}
//---------------------------------------------------------------------------------------------------
// Блок расчёта и вывода среденей геометрической и средних арифметических
	cout << setw(100) << " " << endl << setw(21) << "G0|" << setw(21) << "A1|" << setw(21) << "A3|" << setw(20) << "MAX1" << endl;
	G0 = pow(G0, (1.0 / (sizeof(X) / sizeof(double))));
	A1 = A1 / (sizeof(X) / sizeof(double));
	A3 = A3 / (sizeof(X) / sizeof(double));
	cout << setw(20) << G0 << "|" << setw(20) << A1 << "|" << setw(20) << A3 << "|" << setw(20) << MAX1 << endl;
//---------------------------------------------------------------------------------------------------
// Блок вывода масивов
	cout << setw(100) << " " << endl << setw(21) << "R1|" << setw(21) << "R3|" << endl ;
	for (int i = 0; i < (sizeof(X) / sizeof(double)); i++) {
		if (R1[i] != NULL && R3[i] != NULL) {
			cout << setw(20) << R1[i] << "|" << setw(20) << R3[i] << "|" << endl;
		} else if (R1[i] != NULL && R3[i] == NULL) {
			cout << setw(20) << R1[i] << "|" << endl;
		}
	}
//---------------------------------------------------------------------------------------------------
return 0;
}
